content/recipe/butter-chicken.md
---
title: "Butter Chicken"
author: ["Linden"]
date: 2022-05-30T00:00:00-07:00
categories: ["entree"]
draft: false
source-url: "https://www.recipetineats.com/butter-chicken/"
servings: 3
prep-time: 10
cook-time: 25
ready-in: 35
---

## Ingredients <span class="tag"><span class="GF">GF</span></span> {#ingredients}

Some basmati or white along with the stuff required to make the Marinade and Curry.


### Marinade {#marinade}

-   1/2 cup plain yoghurt, full fat
-   1 tbsp lemon juice
-   1 tsp tumeric powder
-   2 tsp garam masala
-   1/2 tsp chilli powder or cayenne pepper powder (Note 2)
-   1 tsp ground cumin
-   1 tbsp ginger, freshly grated
-   2 cloves garlic, crushed
-   1.5 lb / 750 g chicken thigh fillets, cut into bite size pieces


### Curry {#curry}

-   2 tbsp (30 g) ghee or butter, OR 1 tbsp vegetable oil (Note 3)
-   1 cup tomato passata (aka tomato puree) (Note 4)
-   1 cup heavy / thickened cream (Note 5)
-   1 tbsp sugar
-   1 1/4 tsp salt


## Directions {#directions}

1.  Optional blitz:  for an extra smooth sauce, combine the Marinade ingredients (except the chicken) in a food processor and blend until smooth. (I do not do this)
2.  Marinade:  Combine the Marinade ingredients with the chicken in a bowl. Cover and refrigerate overnight, or up to 24 hours (minimum 3 hrs).
3.  Cook chicken:  Heat the ghee (butter or oil) over high heat in a large fry pan. Take the chicken out of the Marinade but do not wipe or shake off the marinade from the chicken (but don't pour the Marinade left in the bowl into the fry pan).
4.  Place chicken in the fry pan and cook for around 3 minutes, or until the chicken is white all over (it doesn't really brown because of the Marinade).
5.  Sauce: Add the tomato passata, cream, sugar and salt. Also add any remaining marinade left in the bowl. Turn down to low and simmer for 20 minutes. Do a taste test to see if it needs more salt.
6.  Garnish with coriander/cilantro leaves if using. Serve with white/basmati rice.